In [ ]:
import pandas as pd
import numpy as np
import seaborn as sns

In [ ]:
sns.get_dataset_names()

In [ ]:
sns.load_dataset('penguins')

In [ ]:
df = sns.load_dataset('penguins')
df

In [ ]:
df.shape
a, b = df.shape

In [ ]:
print(f'From the above table we find the table contains {a} number of rows and {b} number of columns.')

In [ ]:
df.isnull().sum()

In [ ]:
df.info()

In [ ]:
df.dtypes

In [ ]:
# to swap the first and last number
p = []
n = int(input('Enter the no of elements assigning in list:'))
for i in range(0,n):
    c = int(input('Enter the element:' +str(i+1)+ ':'))
    p.append(c)
x = p[0]
p[0] = p[n-1]
p[n-1] = x
print(f'Swapping elements and the new list is {p}')

In [ ]:
print('Helloworld')

In [ ]:
a = 'ram'
a

In [ ]:
# ram store in a variable 
# variable are temperory storage place

In [ ]:
student = 'bob'
student

In [ ]:
 a1 = 10
print(a1)

In [ ]:
type(a1)

In [ ]:
a1 = 3.33
print(a1)

In [ ]:
type(a1)

In [ ]:
 a = 3+4j
type(a)

In [ ]:
a = 3
b = 5
a,b

In [ ]:
a+b

In [ ]:
a-b

In [ ]:
a*2

In [ ]:
a/b

In [ ]:
a = 50
b = 40
a > b

In [ ]:
a < b

In [ ]:
a == b

In [ ]:
a != b

In [ ]:
a = True
b = False
a & b

In [ ]:
a | b

In [ ]:
b & a

In [ ]:
 print('hello')

In [ ]:
p = "python"
p

In [ ]:
b = '''goat


'''
b

In [ ]:
d = 'mygoat cr7'

In [ ]:
d[6]

In [ ]:
place = 'i live in kathmandu'
place.upper()

In [ ]:
 place.lower()

In [ ]:
place.replace('l','k')

In [ ]:
place.replace('in','out')

In [ ]:
k = 'sss sss ccc vvv bbb'
k.count('sss')

In [ ]:
l = 'live vvv ve ve'
l.count('v')

In [ ]:
p = 'i love nepal,mango,apple'
p.split(',')

In [ ]:
p.split('a')

In [ ]:
p = 'i love mountain, study,family'
p.find('love')

In [ ]:
tup1 = (1,2,3,4)
tup2 = (5,6,7,8)
tup1 + tup2

In [ ]:
import numpy as np
import pandas as pd
import seaborn as sns

In [ ]:
sns.get_dataset_names()

In [ ]:
df = sns.load_dataset('flights')

In [ ]:
df

In [ ]:
df.head(7)

In [ ]:
df.tail(5)

In [ ]:
df.info()

In [ ]:
df.isnull().sum()

In [ ]:
df.count()

In [ ]:
df.shape

In [ ]:
df.iloc[1:3, 0:4]

In [ ]:
df.loc[1:3,['month','year']]

In [ ]:
df.loc[0:2, ['year','passengers']]

In [ ]:
df.iloc[0:3, 0:2]
df

In [ ]:
df.loc[(df['month'] == 'Feb') & (df['passengers'] == 1949 )]

In [ ]:
dc = sns.load_dataset('titanic')
dc.head(3)

In [ ]:
dc.loc[(dc['sex'] == 'male') & (['embark_town'] == 'Southampton')]

In [1]:
import numpy as np
import pandas as pd
import seaborn as sns

In [2]:
sns.get_dataset_names()

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'dowjones',
 'exercise',
 'flights',
 'fmri',
 'geyser',
 'glue',
 'healthexp',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'seaice',
 'taxis',
 'tips',
 'titanic']

In [10]:
dc = sns.load_dataset('titanic')
dc.head(4)
dc.tail(2)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

In [15]:
dc.loc[(dc['sex'] == 'male') & (dc['embark_town'] == 'Cherbourg') & (dc['class'] == 'Third')].count()
pass

In [18]:
dc.iloc[0:4, 1:4]

   pclass     sex   age
0       3    male  22.0
1       1  female  38.0
2       3  female  26.0
3       1  female  35.0

In [21]:
dc.loc[0:4, ['fare','sex']]

      fare     sex
0   7.2500    male
1  71.2833  female
2   7.9250  female
3  53.1000  female
4   8.0500    male

In [23]:
dc['embark_town']

0      Southampton
1        Cherbourg
2      Southampton
3      Southampton
4      Southampton
          ...
886    Southampton
887    Southampton
888    Southampton
889      Cherbourg
890     Queenstown
Name: embark_town, Length: 891, dtype: object

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

In [2]:
sns.get_dataset_names()

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'dowjones',
 'exercise',
 'flights',
 'fmri',
 'geyser',
 'glue',
 'healthexp',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'seaice',
 'taxis',
 'tips',
 'titanic']

In [4]:
df = sns.load_dataset('penguins')
df

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,Female
...,...,...,...,...,...,...,...
339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN
340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,Female
341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,Male
342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,Female
343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,Male

In [5]:
df.head(3)

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female

In [6]:
df.tail(3)

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,Male
342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,Female
343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,Male

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 344 entries, 0 to 343
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   species            344 non-null    object
 1   island             344 non-null    object
 2   bill_length_mm     342 non-null    float64
 3   bill_depth_mm      342 non-null    float64
 4   flipper_length_mm  342 non-null    float64
 5   body_mass_g        342 non-null    float64
 6   sex                333 non-null    object
dtypes: float64(4), object(3)
memory usage: 18.9+ KB

In [10]:
df.isnull().sum()
df.tail(2)

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,Female
343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,Male

In [11]:
df.loc[(df['island'] == 'Biscoe') & (df['sex'] == 'Female')]

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
20,Adelie,Biscoe,37.8,18.3,174.0,3400.0,Female
22,Adelie,Biscoe,35.9,19.2,189.0,3800.0,Female
25,Adelie,Biscoe,35.3,18.9,187.0,3800.0,Female
27,Adelie,Biscoe,40.5,17.9,187.0,3200.0,Female
28,Adelie,Biscoe,37.9,18.6,172.0,3150.0,Female
...,...,...,...,...,...,...,...
332,Gentoo,Biscoe,43.5,15.2,213.0,4650.0,Female
334,Gentoo,Biscoe,46.2,14.1,217.0,4375.0,Female
338,Gentoo,Biscoe,47.2,13.7,214.0,4925.0,Female
340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,Female
342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,Female

In [15]:
df['species'].count()

344

In [16]:
df.tail(6)

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
338,Gentoo,Biscoe,47.2,13.7,214.0,4925.0,Female
339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN
340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,Female
341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,Male
342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,Female
343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,Male

In [17]:
df.iloc[1:4, 0:5]

  species     island  bill_length_mm  bill_depth_mm  flipper_length_mm
1  Adelie  Torgersen            39.5           17.4              186.0
2  Adelie  Torgersen            40.3           18.0              195.0
3  Adelie  Torgersen             NaN            NaN                NaN

In [18]:
df.loc[1:4,['island','species']]

      island species
1  Torgersen  Adelie
2  Torgersen  Adelie
3  Torgersen  Adelie
4  Torgersen  Adelie

In [28]:
s = np.array([1,2,3,4,4])

In [23]:
s[1:4:1]

array([2, 3, 4])

In [24]:
len(s)

5

In [29]:
type(s)

numpy.ndarray

In [32]:
s = []
n = int(input('Enter the no of elements to be assigned in list:'))
for num in range(0,n):
    v = int(input('Enter a element'+ str(num+1) + ':'))
    s.append(v)
arr = s[0]
s[0] = s[n-1]
s[n-1] = arr
print(s)

Enter the no of elements to be assigned in list:3
Enter a element1:1
Enter a element2:2
Enter a element3:3
[3, 2, 1]

In [39]:
class bird:
    sparow = 2
    def __init__(self,wings,legs,beak,types):
        self.wings = wings
        self.legs = legs
        self.beak = beak
        self.types = types
        
    def sparrow(self):
        return self.wings, self.beak
    
    def dove(self):
        return self.legs,self.types

In [40]:
a = bird(wings='small',legs = 'two', beak = 'small_beak', types = 'different')

In [41]:
b,c = a.sparrow()

In [42]:
v,s = a.dove()

In [43]:
print(f'Sparrow have {b} wings and {c}, whereas Dove have {v} legs . There are {s} types of dove.')

Sparrow have small wings and small_beak, whereas Dove have two legs . There are different types of dove.

In [45]:
l = [1,2,3,4,5]

In [60]:
r = [1,2,3,4,3]
b = [5,6,7,8]
r.extend(b)
r

[1, 2, 3, 4, 3, 5, 6, 7, 8]

In [61]:
r = (1,2,3)
v = (5,6,7)
r + v

(1, 2, 3, 5, 6, 7)

In [63]:
d = [3,6,9,1,11]
d.clear()
d

[]

In [68]:
c = [3,2,1,5,6]
c.insert(1,'43')
c

[3, '43', 2, 1, 5, 6]

In [70]:
c[2] = 'r'
c

[3, '43', 'r', 1, 5, 6]

In [73]:
w = [3,2,6,1,5]
w.sort(reverse = True)
w

[6, 5, 3, 2, 1]

In [74]:
w.clear()

In [75]:
w

[]

In [79]:
w.append('2')

In [82]:
w

['2', '2', 3, 9, 8, 7]

In [87]:
d = [3,9,8,7]
w.extend(d)

In [90]:
w

['2', '2', 3, 9, 8, 7, 3, 9, 8, 7, 3, 9, 8, 7, 3, 9, 8, 7]

In [91]:
w.count(3)

4

In [ ]:
# append,extend,sort,reverse,clear,update,insert,len,count,index,copy,pop

In [94]:
t = [2,3,4,5,6]
t.pop()

6

In [95]:
v = [2,7,8,1,9]
c = v.copy()
c

[2, 7, 8, 1, 9]

In [96]:
c

[2, 7, 8, 1, 9]

In [97]:
c[0]

2

In [98]:
import random

In [100]:
import random
(random.radiant(1,44) for i in range(1000)

SyntaxError: invalid syntax (2228421894.py, line 2)